src/Catalogs/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Товары</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Исполнение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДанфосс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрупностьЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗапуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеНапряжениеБатарейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НумераторDanfoss</name>
    <type>
      <types>CatalogRef.НумераторDanfoss</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеФункциональноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стандартный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяIDКлюча</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяIMEI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяMACАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВводНапряженияБатарейки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяКодDanfoss</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяСерийныйНомерEnLogic</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуютсяДМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяBT_IMEI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакПриПолученииЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Канбан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EAN</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СторонняяПоверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрагМеталл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехОснастка</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЯчейкиХранения</name>
    <attributes>
      <name>ЯчейкаХранения</name>
      <type>
        <types>CatalogRef.ЯчейкиХранения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/СтатусыМПЗ/СтатусыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыМПЗ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификаций</types>
      <types>EnumRef.СтатусыМПЗ</types>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыТоваров/СтатусыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыТоваров</name>
  <enumValues>
    <name>Производимый</name>
  </enumValues>
  <enumValues>
    <name>НеПроизводимый</name>
  </enumValues>
  <enumValues>
    <name>СнимаемыйСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>Опытный</name>
  </enumValues>
  <enumValues>
    <name>Проектный</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыМПЗ/СтатусыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМПЗ</name>
  <enumValues>
    <name>Основная</name>
  </enumValues>
  <enumValues>
    <name>ОНР</name>
  </enumValues>
  <enumValues>
    <name>ДоИсчерпанияЗапасов</name>
  </enumValues>
  <enumValues>
    <name>Аналог</name>
  </enumValues>
  <enumValues>
    <name>Неликвид</name>
  </enumValues>
  <enumValues>
    <name>ПроблеммыЛогистики</name>
  </enumValues>
  <enumValues>
    <name>Запрещённая</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Товары/ObjectModule.bsl
Функция ПолучитьМатериал()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка КАК МПЗ,
	|	СтатусыМПЗСрезПоследних.Статус КАК Статус
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПО Материалы.Ссылка = СтатусыМПЗСрезПоследних.МПЗ
	|ГДЕ
	|	Материалы.Товар = &Товар
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыМПЗСрезПоследних.Статус.Порядок";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("Товар", Ссылка);
Возврат(Запрос.Выполнить().Выгрузить());
КонецФункции

Процедура ПередЗаписью(Отказ)
	Если Не Ссылка.Пустая() Тогда
		Если Ссылка.Статус <> Статус Тогда
		Выборка = ПолучитьМатериал();
			Если Выборка.Количество() > 0 Тогда
			МПЗ = Выборка[0].МПЗ;              
				Если Найти(ПолучитьВерхнегоРодителя(МПЗ).Наименование,"Товары для перепродажи") = 0 Тогда
				Возврат;
				КонецЕсли;
			СтатусМПЗ = Выборка[0].Статус;
				Если Статус = Перечисления.СтатусыТоваров.НеПроизводимый Тогда
					Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.Запрещённая Тогда
					СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
					СтатусыМПЗ.Период = ТекущаяДата();
					СтатусыМПЗ.МПЗ = МПЗ;
					СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.Запрещённая;
					СтатусыМПЗ.Записать(Истина);			
					КонецЕсли;
				ИначеЕсли Статус = Перечисления.СтатусыТоваров.СнимаемыйСПроизводства Тогда
					Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.ДоИсчерпанияЗапасов Тогда
					СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
					СтатусыМПЗ.Период = ТекущаяДата();
					СтатусыМПЗ.МПЗ = МПЗ;
					СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.ДоИсчерпанияЗапасов;
					СтатусыМПЗ.Записать(Истина);			
					КонецЕсли;
				ИначеЕсли Статус = Перечисления.СтатусыТоваров.Производимый Тогда
					Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.Основная Тогда
					СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
					СтатусыМПЗ.Период = ТекущаяДата();
					СтатусыМПЗ.МПЗ = МПЗ;
					СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.Основная;
					СтатусыМПЗ.Записать(Истина);			
					КонецЕсли;
				ИначеЕсли Статус = Перечисления.СтатусыТоваров.Опытный Тогда
					Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.ОНР Тогда
					СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
					СтатусыМПЗ.Период = ТекущаяДата();
					СтатусыМПЗ.МПЗ = МПЗ;
					СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.ОНР;
					СтатусыМПЗ.Записать(Истина);			
					КонецЕсли;
				ИначеЕсли Статус = Перечисления.СтатусыТоваров.Проектный Тогда
					Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.ОНР Тогда
					СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
					СтатусыМПЗ.Период = ТекущаяДата();
					СтатусыМПЗ.МПЗ = МПЗ;
					СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.ОНР;
					СтатусыМПЗ.Записать(Истина);			
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
